SebsCubs/seguidorLinea/Project_Headers/mc9s08qe16.h
#define TPM3C3SC_ELS3A_MASK             4U
#define TPM3C3SC_ELS3B_MASK             8U
#define TPM3C3SC_MS3A_MASK              16U
#define TPM3C3SC_MS3B_MASK              32U
#define TPM3C3SC_CH3IE_MASK             64U
#define TPM3C3SC_CH3F_MASK              128U
#define TPM3C3SC_ELS3x_MASK             12U
#define TPM3C3SC_ELS3x_BITNUM           2U
#define TPM3C3SC_MS3x_MASK              48U
#define TPM3C3SC_MS3x_BITNUM            4U


/*** TPM3C3V - TPM3 Timer Channel 3 Value Register; 0x0000006F ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3C3VH - TPM3 Timer Channel 3 Value Register High; 0x0000006F ***/
    union {
      byte Byte;
    } TPM3C3VHSTR;
    #define TPM3C3VH                    _TPM3C3V.Overlap_STR.TPM3C3VHSTR.Byte
    

    /*** TPM3C3VL - TPM3 Timer Channel 3 Value Register Low; 0x00000070 ***/
    union {
      byte Byte;
    } TPM3C3VLSTR;
    #define TPM3C3VL                    _TPM3C3V.Overlap_STR.TPM3C3VLSTR.Byte
    
  } Overlap_STR;

} TPM3C3VSTR;
extern volatile TPM3C3VSTR _TPM3C3V @0x0000006F;
#define TPM3C3V                         _TPM3C3V.Word


/*** TPM3C4SC - TPM3 Timer Channel 4 Status and Control Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte ELS4A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS4B       :1;                                       /* Edge/Level Select Bit B */
    byte MS4A        :1;                                       /* Mode Select A for TPM Channel 4 */
    byte MS4B        :1;                                       /* Mode Select B for TPM Channel 4 */
    byte CH4IE       :1;                                       /* Channel 4 Interrupt Enable */
    byte CH4F        :1;                                       /* Channel 4 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS4x :2;
    byte grpMS4x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3C4SCSTR;
extern volatile TPM3C4SCSTR _TPM3C4SC @0x00000071;
#define TPM3C4SC                        _TPM3C4SC.Byte
#define TPM3C4SC_ELS4A                  _TPM3C4SC.Bits.ELS4A
#define TPM3C4SC_ELS4B                  _TPM3C4SC.Bits.ELS4B
#define TPM3C4SC_MS4A                   _TPM3C4SC.Bits.MS4A
#define TPM3C4SC_MS4B                   _TPM3C4SC.Bits.MS4B
#define TPM3C4SC_CH4IE                  _TPM3C4SC.Bits.CH4IE
#define TPM3C4SC_CH4F                   _TPM3C4SC.Bits.CH4F
#define TPM3C4SC_ELS4x                  _TPM3C4SC.MergedBits.grpELS4x
#define TPM3C4SC_MS4x                   _TPM3C4SC.MergedBits.grpMS4x

#define TPM3C4SC_ELS4A_MASK             4U
#define TPM3C4SC_ELS4B_MASK             8U
#define TPM3C4SC_MS4A_MASK              16U
#define TPM3C4SC_MS4B_MASK              32U
#define TPM3C4SC_CH4IE_MASK             64U
#define TPM3C4SC_CH4F_MASK              128U
#define TPM3C4SC_ELS4x_MASK             12U
#define TPM3C4SC_ELS4x_BITNUM           2U
#define TPM3C4SC_MS4x_MASK              48U
#define TPM3C4SC_MS4x_BITNUM            4U


/*** TPM3C4V - TPM3 Timer Channel 4 Value Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3C4VH - TPM3 Timer Channel 4 Value Register High; 0x00000072 ***/
    union {
      byte Byte;
    } TPM3C4VHSTR;
    #define TPM3C4VH                    _TPM3C4V.Overlap_STR.TPM3C4VHSTR.Byte
    

    /*** TPM3C4VL - TPM3 Timer Channel 4 Value Register Low; 0x00000073 ***/
    union {
      byte Byte;
    } TPM3C4VLSTR;
    #define TPM3C4VL                    _TPM3C4V.Overlap_STR.TPM3C4VLSTR.Byte
    
  } Overlap_STR;

} TPM3C4VSTR;
extern volatile TPM3C4VSTR _TPM3C4V @0x00000072;
#define TPM3C4V                         _TPM3C4V.Word


/*** TPM3C5SC - TPM3 Timer Channel 5 Status and Control Register; 0x00000074 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte ELS5A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS5B       :1;                                       /* Edge/Level Select Bit B */
    byte MS5A        :1;                                       /* Mode Select A for TPM Channel 5 */
    byte MS5B        :1;                                       /* Mode Select B for TPM Channel 5 */
    byte CH5IE       :1;                                       /* Channel 5 Interrupt Enable */
    byte CH5F        :1;                                       /* Channel 5 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS5x :2;
    byte grpMS5x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3C5SCSTR;
extern volatile TPM3C5SCSTR _TPM3C5SC @0x00000074;
#define TPM3C5SC                        _TPM3C5SC.Byte
#define TPM3C5SC_ELS5A                  _TPM3C5SC.Bits.ELS5A
#define TPM3C5SC_ELS5B                  _TPM3C5SC.Bits.ELS5B
#define TPM3C5SC_MS5A                   _TPM3C5SC.Bits.MS5A
#define TPM3C5SC_MS5B                   _TPM3C5SC.Bits.MS5B
#define TPM3C5SC_CH5IE                  _TPM3C5SC.Bits.CH5IE
#define TPM3C5SC_CH5F                   _TPM3C5SC.Bits.CH5F
#define TPM3C5SC_ELS5x                  _TPM3C5SC.MergedBits.grpELS5x
#define TPM3C5SC_MS5x                   _TPM3C5SC.MergedBits.grpMS5x

#define TPM3C5SC_ELS5A_MASK             4U
#define TPM3C5SC_ELS5B_MASK             8U
#define TPM3C5SC_MS5A_MASK              16U
#define TPM3C5SC_MS5B_MASK              32U
#define TPM3C5SC_CH5IE_MASK             64U
#define TPM3C5SC_CH5F_MASK              128U
#define TPM3C5SC_ELS5x_MASK             12U
#define TPM3C5SC_ELS5x_BITNUM           2U
#define TPM3C5SC_MS5x_MASK              48U
#define TPM3C5SC_MS5x_BITNUM            4U


/*** TPM3C5V - TPM3 Timer Channel 5 Value Register; 0x00000075 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3C5VH - TPM3 Timer Channel 5 Value Register High; 0x00000075 ***/
    union {
      byte Byte;
    } TPM3C5VHSTR;
    #define TPM3C5VH                    _TPM3C5V.Overlap_STR.TPM3C5VHSTR.Byte
    

    /*** TPM3C5VL - TPM3 Timer Channel 5 Value Register Low; 0x00000076 ***/
    union {
      byte Byte;
    } TPM3C5VLSTR;
    #define TPM3C5VL                    _TPM3C5V.Overlap_STR.TPM3C5VLSTR.Byte
    
  } Overlap_STR;

} TPM3C5VSTR;
extern volatile TPM3C5VSTR _TPM3C5V @0x00000075;
#define TPM3C5V                         _TPM3C5V.Word


/*** SRS - System Reset Status Register; 0x00001800 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LVD         :1;                                       /* Low Voltage Detect */
    byte             :1; 
    byte ILAD        :1;                                       /* Illegal Address */
    byte ILOP        :1;                                       /* Illegal Opcode */
    byte COP         :1;                                       /* Computer Operating Properly (COP) Watchdog */
    byte PIN         :1;                                       /* External Reset Pin */
    byte POR         :1;                                       /* Power-On Reset */
  } Bits;
} SRSSTR;
